In [2]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randint(1, 10, size=(2, 2)),
                   columns=list('ab'), index=list('xy'))
df2 = pd.DataFrame(np.random.randint(1, 10, size=(2, 2)),
                   columns=list('ab'), index=list('zt'))

In [5]:
pd.concat([df1, df2])

   a  b
x  5  8
y  5  3
z  1  2
t  6  9

In [7]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randint(1, 10, size=(2, 2)),
                   columns=list('ab'), index=list('xy'))
df2 = pd.DataFrame(np.random.randint(1, 10, size=(2, 2)),
                   columns=list('cd'), index=list('xy'))

In [12]:
pd.concat([df1, df2],axis=1)

   a  b  c  d
x  7  4  5  6
y  6  4  1  4

In [14]:
df1 = pd.DataFrame({'personnel': ['Bob', 'Lisa', 'Sue'],
                   'groupe': ['SAF', 'R&D', 'RH']})
df2 = pd.DataFrame({'personnel': ['Lisa', 'Bob', 'Sue'],
                    'date embauche': [2004, 2008, 2014]})

In [16]:
pd.merge(df1, df2)

  personnel groupe  date embauche
0       Bob    SAF           2008
1      Lisa    R&D           2004
2       Sue     RH           2014

In [20]:
import seaborn as sns

In [23]:
ti = sns.load_dataset('titanic').loc[:,["survived","sex","class"]]

In [26]:
ti.head()

   survived     sex  class
0         0    male  Third
1         1  female  First
2         1  female  Third
3         1  female  First
4         0    male  Third

In [34]:
ti.loc[:,"survived"].mean()

0.3838383838383838

In [45]:
ti.loc[ti.loc[:,"class"]=="First","survived"].mean()

0.6296296296296297

In [48]:
ti.groupby("class").mean()

        survived
class
First   0.629630
Second  0.472826
Third   0.242363

In [50]:
g = ti.groupby(["class", "sex"]).mean()

In [52]:
g

               survived
class  sex
First  female  0.968085
       male    0.368852
Second female  0.921053
       male    0.157407
Third  female  0.500000
       male    0.135447

In [54]:
g.index

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])

In [59]:
ti.pivot_table("survived", aggfunc=np.mean,index="class",columns="sex")

sex       female      male
class
First   0.968085  0.368852
Second  0.921053  0.157407
Third   0.500000  0.135447